backend/controllers/CategoryController.php

SELECT `c`.*, `m`.`name` AS `model_name` FROM `cms_category`AS `c` LEFT JOIN `cms_model` `m` ON m.id = c.modelid WHERE `c`.`is_delete`=2
---
    public function actionCategoryList(){
        if($this->isPost()){
            $category_list = (new \yii\db\Query())
            ->select('c.*,m.name AS model_name')
            ->from(Category::tableName().'AS c')
            ->leftJoin(Model::tableName().' AS m','m.id = c.modelid')
            ->where(['c.is_delete'=>Category::DELETE_STATUS_FALSE])
            ->all();

INSERT INTO `cms_category` (`catname`, `type`, `modelid`, `parentid`, `description`, `image`, `url`, `ismenu`, `letter`, `created_at`, `updated_at`) VALUES ('企业介绍', 1, 58, 66, '', '', '', 1, 'qiyejieshao', 1516082756, 1516082756)
SELECT * FROM `cms_category` WHERE `catid`='66'
---
    public function actionAddCategory(){
        if($this->isPost()){
            $transaction = Yii::$app->db->beginTransaction();
            $model = new Category();
            $model->setScenario('add_category');
            $post = Yii::$app->request->post();
            // p($post);
            $parentid = $post['parentid'];
            $post['letter'] = (new PinYin())->getAllPY($post['catname']);//拼音转换
            try {
                if($model->load($post,'') && $model->validate()){
                    $model_rs = $model->save(false);
                    if($parentid != 0){
                        $parentInfo = (new Category())->findOne($parentid);