backend/controllers/ConfigController.php

SELECT * FROM `cms_config` WHERE `varname`='theme'
UPDATE `cms_config` SET `value`='Default1' WHERE `id`=19
---
    public function actionChangeTemplate(){
        $name = $this->post('temp_name','');
        if($name == ''){
            return $this->ajaxFail('更改失败，参数异常');
        }
        $theme_info = (new Config())->findOne(['varname'=>Config::THEME_NAME]);
        $theme_info->value = $name;
        $rs = $theme_info->save(false);