backend/controllers/FieldController.php

SELECT * FROM `cms_model` WHERE `id`='29'
---
    public function actionEditField(){
        try {
            $transaction = Yii::$app->db->beginTransaction();
            if($this->isPost()){
                $modelId      = $this->post('modelId','');
                $fieldId      = $this->post('fieldId','');
                $fieldInfo    = $this->post('fieldInfo',[]);
                $configParams = $this->post('configParams',[]);
                if($modelId == '' || $fieldId =='' || empty($fieldInfo) || empty($configParams)){
                    return $this->ajaxFail('参数异常');
                }
                $modelInfo = (new Model())->findOne($modelId);