backend/controllers/MenuController.php

SELECT * FROM `cms_menu` ORDER BY `sort`
---
    public function actionMenuList(){
        $menu_list  = (new Menu())->find()->orderBy('sort ASC')->asArray()->all();