backend/controllers/ModelController.php

    public function actionGetModelList(){
        $sql        = (new Model())->find();
        $sql->andWhere(['=','is_delete',Model::DELETE_STATUS_FALSE]);
        $sql->andFilterWhere(['or',
            ['like','name',$this->get('keyworlds')],
            ['like','desc',$this->get('keyworlds')],
            ['like','e_name',$this->get('keyworlds')]
        ]);
        if($this->get('status') != '-1'){
            $sql->andFilterWhere(['=','status',$this->get('status')]);
        }
        $d =  $sql->orderBy('created_at DESC')->asArray()->all();
---
SELECT * FROM `cms_model` WHERE `is_delete` = 2 ORDER BY `created_at` DESC