common/models/Category.php

SELECT * FROM `cms_category` WHERE `catid`=73
UPDATE `cms_category` SET `url`='category-list?catid=73&modelid=58' WHERE `catid`=73
---
    public function afterSave($insert,$changedAttributes) {
        if($this->url == ''){
            $model = (new Category())->findOne($this->catid);
            $model->url = '/category/list?catid='.$this->catid.'&modelid='.$this->modelid;
            if($model->save(false)){

SELECT `m`.`name` AS `model_name`, `m`.`e_name` AS `table_name` FROM `cms_category`AS `c` LEFT JOIN `cms_model` `m` ON m.id = c.modelid WHERE (`c`.`catid`='68') AND (`c`.`is_delete`=2)
---
    public function getCategoryModel($catid = ''){
         if($catid == ''){
           return false;
         }
         $rs = (new Query())
        ->select('m.name AS model_name,m.e_name AS table_name')
        ->from(Category::tableName().'AS c')
        ->leftJoin(Model::tableName().' AS m','m.id = c.modelid')
        ->where(['c.catid'=>$catid,'c.is_delete'=>Category::DELETE_STATUS_FALSE])
        ->one();

SELECT `m`.`name` AS `model_name`, `m`.`e_name` AS `table_name`, `c`.* FROM `cms_category`AS `c` LEFT JOIN `cms_model` `m` ON m.id = c.modelid WHERE (`c`.`catid`='69') AND (`c`.`is_delete`=2)
---
    public function getCategoryInfo($catid = ''){
        if($catid == ''){
            return false;
        }
        $rs = (new Query())
        ->select('m.name AS model_name,m.e_name AS table_name,c.*')
        ->from(Category::tableName().'AS c')
        ->leftJoin(Model::tableName().' AS m','m.id = c.modelid')
        ->where(['c.catid'=>$catid,'c.is_delete'=>Category::DELETE_STATUS_FALSE])
        ->one();

SELECT `catid`, `modelid`, `catname`, `url`, `parentid`, `type`, `child` FROM `cms_category` WHERE `is_delete`=2
---
    public function getAllCategory(){
        return (new Category())->find()
        ->where(['is_delete'=>Category::DELETE_STATUS_FALSE])
        ->select('catid,modelid,catname,url,parentid,type,child')
        ->asArray()
        ->all();

SELECT `catid`, `parentid`, `catname`, `type`, `modelid`, `child` FROM `cms_category` WHERE ((`modelid`='58') AND (`is_delete`=2)) AND (`type`=1)
---
    public function getCategoryList($model_id = '',$is_page = true){
        if($model_id == ''){
          return false;
        }
        $model = new Category();
        $sql = $model->find()
        ->select('catid,parentid,catname,type,modelid,child,url')
        ->where(['modelid'=>$model_id,'is_delete'=>$model::DELETE_STATUS_FALSE]);