common/models/Config.php

    public static function getAllConfig($is_delete = false){
        $cache = Yii::$app->cache;
        if($is_delete === true){//如果是重新获取，则将当前缓存的删除
            $cache->delete('configs');
        }
        $list = $cache->get('configs');
        if ($list === false) {
            $all_config = self::find()->asArray()->all();
---
SELECT * FROM `cms_config`